#ifndef SCHEMA_READER_H
#define SCHEMA_READER_H

/* Generated by flatcc 0.6.1-dev FlatBuffers schema compiler for C by dvide.com */

#ifndef FLATBUFFERS_COMMON_READER_H
#include "flatbuffers_common_reader.h"
#endif
#include "flatcc/flatcc_flatbuffers.h"
#ifndef __alignas_is_defined
#include <stdalign.h>
#endif
#include "flatcc/flatcc_prologue.h"
#ifndef flatbuffers_identifier
#define flatbuffers_identifier 0
#endif
#ifndef flatbuffers_extension
#define flatbuffers_extension ".bin"
#endif

typedef struct VOLTAGES_CB0_0 VOLTAGES_CB0_0_t;
typedef const VOLTAGES_CB0_0_t *VOLTAGES_CB0_0_struct_t;
typedef VOLTAGES_CB0_0_t *VOLTAGES_CB0_0_mutable_struct_t;
typedef const VOLTAGES_CB0_0_t *VOLTAGES_CB0_0_vec_t;
typedef VOLTAGES_CB0_0_t *VOLTAGES_CB0_0_mutable_vec_t;
typedef struct VOLTAGES_CB0_1 VOLTAGES_CB0_1_t;
typedef const VOLTAGES_CB0_1_t *VOLTAGES_CB0_1_struct_t;
typedef VOLTAGES_CB0_1_t *VOLTAGES_CB0_1_mutable_struct_t;
typedef const VOLTAGES_CB0_1_t *VOLTAGES_CB0_1_vec_t;
typedef VOLTAGES_CB0_1_t *VOLTAGES_CB0_1_mutable_vec_t;
typedef struct VOLTAGES_CB0_2 VOLTAGES_CB0_2_t;
typedef const VOLTAGES_CB0_2_t *VOLTAGES_CB0_2_struct_t;
typedef VOLTAGES_CB0_2_t *VOLTAGES_CB0_2_mutable_struct_t;
typedef const VOLTAGES_CB0_2_t *VOLTAGES_CB0_2_vec_t;
typedef VOLTAGES_CB0_2_t *VOLTAGES_CB0_2_mutable_vec_t;
typedef struct VOLTAGES_CB0_3 VOLTAGES_CB0_3_t;
typedef const VOLTAGES_CB0_3_t *VOLTAGES_CB0_3_struct_t;
typedef VOLTAGES_CB0_3_t *VOLTAGES_CB0_3_mutable_struct_t;

/* deprecated, use VOLTAGES_CB5_2_file_identifier */
#ifndef VOLTAGES_CB5_2_identifier
#define VOLTAGES_CB5_2_identifier flatbuffers_identifier
#endif
#define VOLTAGES_CB5_2_type_hash ((flatbuffers_thash_t)0xa278ea0c)
#define VOLTAGES_CB5_2_type_identifier "\x0c\xea\x78\xa2"
#ifndef VOLTAGES_CB5_3_file_identifier
#define VOLTAGES_CB5_3_file_identifier flatbuffers_identifier
#endif
/* deprecated, use VOLTAGES_CB5_3_file_identifier */
#ifndef VOLTAGES_CB5_3_identifier
#define VOLTAGES_CB5_3_identifier flatbuffers_identifier
#endif
#define VOLTAGES_CB5_3_type_hash ((flatbuffers_thash_t)0xa378eb9f)
#define VOLTAGES_CB5_3_type_identifier "\x9f\xeb\x78\xa3"
#ifndef VOLTAGES_CB5_4_file_identifier
#define VOLTAGES_CB5_4_file_identifier flatbuffers_identifier
#endif
/* deprecated, use VOLTAGES_CB5_4_file_identifier */
#ifndef VOLTAGES_CB5_4_identifier
#define VOLTAGES_CB5_4_identifier flatbuffers_identifier
#endif
#define VOLTAGES_CB5_4_type_hash ((flatbuffers_thash_t)0xa078e6e6)
#define VOLTAGES_CB5_4_type_identifier "\xe6\xe6\x78\xa0"
#ifndef TEMPERATURES_CB5_0_file_identifier
#define TEMPERATURES_CB5_0_file_identifier flatbuffers_identifier
#endif
/* deprecated, use TEMPERATURES_CB5_0_file_identifier */
#ifndef TEMPERATURES_CB5_0_identifier
#define TEMPERATURES_CB5_0_identifier flatbuffers_identifier
#endif
#define TEMPERATURES_CB5_0_type_hash ((flatbuffers_thash_t)0xce26fb02)
#define TEMPERATURES_CB5_0_type_identifier "\x02\xfb\x26\xce"
#ifndef TEMPERATURES_CB5_1_file_identifier
#define TEMPERATURES_CB5_1_file_identifier flatbuffers_identifier
#endif
/* deprecated, use TEMPERATURES_CB5_1_file_identifier */
#ifndef TEMPERATURES_CB5_1_identifier
#define TEMPERATURES_CB5_1_identifier flatbuffers_identifier
#endif
#define TEMPERATURES_CB5_1_type_hash ((flatbuffers_thash_t)0xcf26fc95)
#define TEMPERATURES_CB5_1_type_identifier "\x95\xfc\x26\xcf"
#ifndef TEMPERATURES_CB5_2_file_identifier
#define TEMPERATURES_CB5_2_file_identifier flatbuffers_identifier
#endif
/* deprecated, use TEMPERATURES_CB5_2_file_identifier */
#ifndef TEMPERATURES_CB5_2_identifier
#define TEMPERATURES_CB5_2_identifier flatbuffers_identifier
#endif
#define TEMPERATURES_CB5_2_type_hash ((flatbuffers_thash_t)0xcc26f7dc)
#define TEMPERATURES_CB5_2_type_identifier "\xdc\xf7\x26\xcc"
#ifndef MASTER_SYNC_file_identifier
#define MASTER_SYNC_file_identifier flatbuffers_identifier
#endif
/* deprecated, use MASTER_SYNC_file_identifier */
#ifndef MASTER_SYNC_identifier
#define MASTER_SYNC_identifier flatbuffers_identifier
#endif
#define MASTER_SYNC_type_hash ((flatbuffers_thash_t)0xb8742687)
#define MASTER_SYNC_type_identifier "\x87\x26\x74\xb8"
#ifndef CELLBOARD_TOKEN_file_identifier
#define CELLBOARD_TOKEN_file_identifier flatbuffers_identifier
#endif
/* deprecated, use CELLBOARD_TOKEN_file_identifier */
#ifndef CELLBOARD_TOKEN_identifier
#define CELLBOARD_TOKEN_identifier flatbuffers_identifier
#endif
#define CELLBOARD_TOKEN_type_hash ((flatbuffers_thash_t)0xc7c3a349)
#define CELLBOARD_TOKEN_type_identifier "\x49\xa3\xc3\xc7"


struct VOLTAGES_CB0_0 {
    alignas(2) uint16_t voltage0;
    alignas(2) uint16_t voltage1;
    alignas(2) uint16_t voltage2;
    alignas(2) uint16_t voltage3;
};
static_assert(sizeof(VOLTAGES_CB0_0_t) == 8, "struct size mismatch");

static inline const VOLTAGES_CB0_0_t *VOLTAGES_CB0_0__const_ptr_add(const VOLTAGES_CB0_0_t *p, size_t i) { return p + i; }
static inline VOLTAGES_CB0_0_t *VOLTAGES_CB0_0__ptr_add(VOLTAGES_CB0_0_t *p, size_t i) { return p + i; }
static inline VOLTAGES_CB0_0_struct_t VOLTAGES_CB0_0_vec_at(VOLTAGES_CB0_0_vec_t vec, size_t i)
__flatbuffers_struct_vec_at(vec, i)
static inline size_t VOLTAGES_CB0_0__size(void) { return 8; }
static inline size_t VOLTAGES_CB0_0_vec_len(VOLTAGES_CB0_0_vec_t vec)
__flatbuffers_vec_len(vec)
__flatbuffers_struct_as_root(VOLTAGES_CB0_0)

__flatbuffers_define_struct_scalar_field(VOLTAGES_CB0_0, voltage0, flatbuffers_uint16, uint16_t)
__flatbuffers_define_struct_scalar_field(VOLTAGES_CB0_0, voltage1, flatbuffers_uint16, uint16_t)
__flatbuffers_define_struct_scalar_field(VOLTAGES_CB0_0, voltage2, flatbuffers_uint16, uint16_t)
__flatbuffers_define_struct_scalar_field(VOLTAGES_CB0_0, voltage3, flatbuffers_uint16, uint16_t)

struct VOLTAGES_CB0_1 {
    alignas(2) uint16_t voltage4;
    alignas(2) uint16_t voltage5;
    alignas(2) uint16_t voltage6;
    alignas(2) uint16_t voltage7;
};
static_assert(sizeof(VOLTAGES_CB0_1_t) == 8, "struct size mismatch");

static inline const VOLTAGES_CB0_1_t *VOLTAGES_CB0_1__const_ptr_add(const VOLTAGES_CB0_1_t *p, size_t i) { return p + i; }
static inline VOLTAGES_CB0_1_t *VOLTAGES_CB0_1__ptr_add(VOLTAGES_CB0_1_t *p, size_t i) { return p + i; }
static inline VOLTAGES_CB0_1_struct_t VOLTAGES_CB0_1_vec_at(VOLTAGES_CB0_1_vec_t vec, size_t i)
__flatbuffers_struct_vec_at(vec, i)
static inline size_t VOLTAGES_CB0_1__size(void) { return 8; }
static inline size_t VOLTAGES_CB0_1_vec_len(VOLTAGES_CB0_1_vec_t vec)
__flatbuffers_vec_len(vec)
__flatbuffers_struct_as_root(VOLTAGES_CB0_1)

__flatbuffers_define_struct_scalar_field(VOLTAGES_CB0_1, voltage4, flatbuffers_uint16, uint16_t)
__flatbuffers_define_struct_scalar_field(VOLTAGES_CB0_1, voltage5, flatbuffers_uint16, uint16_t)
__flatbuffers_define_struct_scalar_field(VOLTAGES_CB0_1, voltage6, flatbuffers_uint16, uint16_t)
__flatbuffers_define_struct_scalar_field(VOLTAGES_CB0_1, voltage7, flatbuffers_uint16, uint16_t)

struct VOLTAGES_CB0_2 {
    alignas(2) uint16_t voltage8;
    alignas(2) uint16_t voltage9;
    alignas(2) uint16_t voltage10;
    alignas(2) uint16_t voltage11;
};
static_assert(sizeof(VOLTAGES_CB0_2_t) == 8, "struct size mismatch");

static inline const VOLTAGES_CB0_2_t *VOLTAGES_CB0_2__const_ptr_add(const VOLTAGES_CB0_2_t *p, size_t i) { return p + i; }
static inline VOLTAGES_CB0_2_t *VOLTAGES_CB0_2__ptr_add(VOLTAGES_CB0_2_t *p, size_t i) { return p + i; }
static inline VOLTAGES_CB0_2_struct_t VOLTAGES_CB0_2_vec_at(VOLTAGES_CB0_2_vec_t vec, size_t i)
__flatbuffers_struct_vec_at(vec, i)
static inline size_t VOLTAGES_CB0_2__size(void) { return 8; }
static inline size_t VOLTAGES_CB0_2_vec_len(VOLTAGES_CB0_2_vec_t vec)
__flatbuffers_vec_len(vec)
__flatbuffers_struct_as_root(VOLTAGES_CB0_2)

__flatbuffers_define_struct_scalar_field(VOLTAGES_CB0_2, voltage8, flatbuffers_uint16, uint16_t)
__flatbuffers_define_struct_scalar_field(VOLTAGES_CB0_2, voltage9, flatbuffers_uint16, uint16_t)
__flatbuffers_define_struct_scalar_field(VOLTAGES_CB0_2, voltage10, flatbuffers_uint16, uint16_t)
__flatbuffers_define_struct_scalar_field(VOLTAGES_CB0_2, voltage11, flatbuffers_uint16, uint16_t)

struct VOLTAGES_CB0_3 {
    alignas(2) uint16_t voltage12;
    alignas(2) uint16_t voltage13;
    alignas(2) uint16_t voltage14;
    alignas(2) uint16_t voltage15;
};
static_assert(sizeof(VOLTAGES_CB0_3_t) == 8, "struct size mismatch");

static inline const VOLTAGES_CB0_3_t *VOLTAGES_CB0_3__const_ptr_add(const VOLTAGES_CB0_3_t *p, size_t i) { return p + i; }
static inline VOLTAGES_CB0_3_t *VOLTAGES_CB0_3__ptr_add(VOLTAGES_CB0_3_t *p, size_t i) { return p + i; }
static inline VOLTAGES_CB0_3_struct_t VOLTAGES_CB0_3_vec_at(VOLTAGES_CB0_3_vec_t vec, size_t i)
__flatbuffers_struct_vec_at(vec, i)
static inline size_t VOLTAGES_CB0_3__size(void) { return 8; }
static inline size_t VOLTAGES_CB0_3_vec_len(VOLTAGES_CB0_3_vec_t vec)
__flatbuffers_vec_len(vec)
__flatbuffers_struct_as_root(VOLTAGES_CB0_3)

__flatbuffers_define_struct_scalar_field(VOLTAGES_CB0_3, voltage12, flatbuffers_uint16, uint16_t)
__flatbuffers_define_struct_scalar_field(VOLTAGES_CB0_3, voltage13, flatbuffers_uint16, uint16_t)
__flatbuffers_define_struct_scalar_field(VOLTAGES_CB0_3, voltage14, flatbuffers_uint16, uint16_t)
__flatbuffers_define_struct_scalar_field(VOLTAGES_CB0_3, voltage15, flatbuffers_uint16, uint16_t)

struct VOLTAGES_CB0_4 {
    alignas(2) uint16_t voltage16;
    alignas(2) uint16_t voltage17;
    alignas(2) uint16_t max_voltage;
    alignas(2) uint16_t min_voltage;
};
static_assert(sizeof(VOLTAGES_CB0_4_t) == 8, "struct size mismatch");

static inline const VOLTAGES_CB0_4_t *VOLTAGES_CB0_4__const_ptr_add(const VOLTAGES_CB0_4_t *p, size_t i) { return p + i; }
static inline VOLTAGES_CB0_4_t *VOLTAGES_CB0_4__ptr_add(VOLTAGES_CB0_4_t *p, size_t i) { return p + i; }
static inline VOLTAGES_CB0_4_struct_t VOLTAGES_CB0_4_vec_at(VOLTAGES_CB0_4_vec_t vec, size_t i)
__flatbuffers_struct_vec_at(vec, i)
static inline size_t VOLTAGES_CB0_4__size(void) { return 8; }
static inline size_t VOLTAGES_CB0_4_vec_len(VOLTAGES_CB0_4_vec_t vec)
__flatbuffers_vec_len(vec)
__flatbuffers_struct_as_root(VOLTAGES_CB0_4)

__flatbuffers_define_struct_scalar_field(VOLTAGES_CB0_4, voltage16, flatbuffers_uint16, uint16_t)
__flatbuffers_define_struct_scalar_field(VOLTAGES_CB0_4, voltage17, flatbuffers_uint16, uint16_t)
__flatbuffers_define_struct_scalar_field(VOLTAGES_CB0_4, max_voltage, flatbuffers_uint16, uint16_t)
__flatbuffers_define_struct_scalar_field(VOLTAGES_CB0_4, min_voltage, flatbuffers_uint16, uint16_t)

struct TEMPERATURES_CB0_0 {
    alignas(1) uint8_t temperature0;
    alignas(1) uint8_t temperature1;
    alignas(1) uint8_t temperature2;
    alignas(1) uint8_t temperature3;
    alignas(1) uint8_t temperature4;
    alignas(1) uint8_t temperature5;
    alignas(1) uint8_t temperature6;
    alignas(1) uint8_t temperature7;
};
static_assert(sizeof(TEMPERATURES_CB0_0_t) == 8, "struct size mismatch");

static inline const TEMPERATURES_CB0_0_t *TEMPERATURES_CB0_0__const_ptr_add(const TEMPERATURES_CB0_0_t *p, size_t i) { return p + i; }
static inline TEMPERATURES_CB0_0_t *TEMPERATURES_CB0_0__ptr_add(TEMPERATURES_CB0_0_t *p, size_t i) { return p + i; }
static inline TEMPERATURES_CB0_0_struct_t TEMPERATURES_CB0_0_vec_at(TEMPERATURES_CB0_0_vec_t vec, size_t i)
__flatbuffers_struct_vec_at(vec, i)
static inline size_t TEMPERATURES_CB0_0__size(void) { return 8; }
static inline size_t TEMPERATURES_CB0_0_vec_len(TEMPERATURES_CB0_0_vec_t vec)
__flatbuffers_vec_len(vec)
__flatbuffers_struct_as_root(TEMPERATURES_CB0_0)

__flatbuffers_define_struct_scalar_field(TEMPERATURES_CB0_0, temperature0, flatbuffers_uint8, uint8_t)
__flatbuffers_define_struct_scalar_field(TEMPERATURES_CB0_0, temperature1, flatbuffers_uint8, uint8_t)
__flatbuffers_define_struct_scalar_field(TEMPERATURES_CB0_0, temperature2, flatbuffers_uint8, uint8_t)
__flatbuffers_define_struct_scalar_field(TEMPERATURES_CB0_0, temperature3, flatbuffers_uint8, uint8_t)
__flatbuffers_define_struct_scalar_field(TEMPERATURES_CB0_0, temperature4, flatbuffers_uint8, uint8_t)
__flatbuffers_define_struct_scalar_field(TEMPERATURES_CB0_0, temperature5, flatbuffers_uint8, uint8_t)
__flatbuffers_define_struct_scalar_field(TEMPERATURES_CB0_0, temperature6, flatbuffers_uint8, uint8_t)
__flatbuffers_define_struct_scalar_field(TEMPERATURES_CB0_0, temperature7, flatbuffers_uint8, uint8_t)

struct TEMPERATURES_CB0_1 {
    alignas(1) uint8_t temperature8;
    alignas(1) uint8_t temperature9;
    alignas(1) uint8_t temperature10;
    alignas(1) uint8_t temperature11;
    alignas(1) uint8_t temperature12;
    alignas(1) uint8_t temperature13;
    alignas(1) uint8_t temperature14;
    alignas(1) uint8_t temperature15;
};
static_assert(sizeof(TEMPERATURES_CB0_1_t) == 8, "struct size mismatch");

static inline const TEMPERATURES_CB0_1_t *TEMPERATURES_CB0_1__const_ptr_add(const TEMPERATURES_CB0_1_t *p, size_t i) { return p + i; }
static inline TEMPERATURES_CB0_1_t *TEMPERATURES_CB0_1__ptr_add(TEMPERATURES_CB0_1_t *p, size_t i) { return p + i; }
static inline TEMPERATURES_CB0_1_struct_t TEMPERATURES_CB0_1_vec_at(TEMPERATURES_CB0_1_vec_t vec, size_t i)
__flatbuffers_struct_vec_at(vec, i)
static inline size_t TEMPERATURES_CB0_1__size(void) { return 8; }
static inline size_t TEMPERATURES_CB0_1_vec_len(TEMPERATURES_CB0_1_vec_t vec)
__flatbuffers_vec_len(vec)
__flatbuffers_struct_as_root(TEMPERATURES_CB0_1)

__flatbuffers_define_struct_scalar_field(TEMPERATURES_CB0_1, temperature8, flatbuffers_uint8, uint8_t)
__flatbuffers_define_struct_scalar_field(TEMPERATURES_CB0_1, temperature9, flatbuffers_uint8, uint8_t)
__flatbuffers_define_struct_scalar_field(TEMPERATURES_CB0_1, temperature10, flatbuffers_uint8, uint8_t)
__flatbuffers_define_struct_scalar_field(TEMPERATURES_CB0_1, temperature11, flatbuffers_uint8, uint8_t)
__flatbuffers_define_struct_scalar_field(TEMPERATURES_CB0_1, temperature12, flatbuffers_uint8, uint8_t)
__flatbuffers_define_struct_scalar_field(TEMPERATURES_CB0_1, temperature13, flatbuffers_uint8, uint8_t)
__flatbuffers_define_struct_scalar_field(TEMPERATURES_CB0_1, temperature14, flatbuffers_uint8, uint8_t)
__flatbuffers_define_struct_scalar_field(TEMPERATURES_CB0_1, temperature15, flatbuffers_uint8, uint8_t)

struct TEMPERATURES_CB0_2 {
    alignas(1) uint8_t temperature16;
    alignas(1) uint8_t temperature17;
};
static_assert(sizeof(TEMPERATURES_CB0_2_t) == 2, "struct size mismatch");

static inline const TEMPERATURES_CB0_2_t *TEMPERATURES_CB0_2__const_ptr_add(const TEMPERATURES_CB0_2_t *p, size_t i) { return p + i; }
static inline TEMPERATURES_CB0_2_t *TEMPERATURES_CB0_2__ptr_add(TEMPERATURES_CB0_2_t *p, size_t i) { return p + i; }
static inline TEMPERATURES_CB0_2_struct_t TEMPERATURES_CB0_2_vec_at(TEMPERATURES_CB0_2_vec_t vec, size_t i)
__flatbuffers_struct_vec_at(vec, i)
static inline size_t TEMPERATURES_CB0_2__size(void) { return 2; }
static inline size_t TEMPERATURES_CB0_2_vec_len(TEMPERATURES_CB0_2_vec_t vec)
__flatbuffers_vec_len(vec)
__flatbuffers_struct_as_root(TEMPERATURES_CB0_2)

__flatbuffers_define_struct_scalar_field(TEMPERATURES_CB0_2, temperature16, flatbuffers_uint8, uint8_t)
__flatbuffers_define_struct_scalar_field(TEMPERATURES_CB0_2, temperature17, flatbuffers_uint8, uint8_t)

struct VOLTAGES_CB1_0 {
    alignas(2) uint16_t voltage0;
    alignas(2) uint16_t voltage1;
    alignas(2) uint16_t voltage2;
    alignas(2) uint16_t voltage3;
};
static_assert(sizeof(VOLTAGES_CB1_0_t) == 8, "struct size mismatch");

static inline const VOLTAGES_CB1_0_t *VOLTAGES_CB1_0__const_ptr_add(const VOLTAGES_CB1_0_t *p, size_t i) { return p + i; }
static inline VOLTAGES_CB1_0_t *VOLTAGES_CB1_0__ptr_add(VOLTAGES_CB1_0_t *p, size_t i) { return p + i; }
static inline VOLTAGES_CB1_0_struct_t VOLTAGES_CB1_0_vec_at(VOLTAGES_CB1_0_vec_t vec, size_t i)
__flatbuffers_struct_vec_at(vec, i)
static inline size_t VOLTAGES_CB1_0__size(void) { return 8; }
static inline size_t VOLTAGES_CB1_0_vec_len(VOLTAGES_CB1_0_vec_t vec)
__flatbuffers_vec_len(vec)
__flatbuffers_struct_as_root(VOLTAGES_CB1_0)

__flatbuffers_define_struct_scalar_field(VOLTAGES_CB1_0, voltage0, flatbuffers_uint16, uint16_t)
__flatbuffers_define_struct_scalar_field(VOLTAGES_CB1_0, voltage1, flatbuffers_uint16, uint16_t)
__flatbuffers_define_struct_scalar_field(VOLTAGES_CB1_0, voltage2, flatbuffers_uint16, uint16_t)
__flatbuffers_define_struct_scalar_field(VOLTAGES_CB1_0, voltage3, flatbuffers_uint16, uint16_t)

struct VOLTAGES_CB1_1 {
    alignas(2) uint16_t voltage4;
    alignas(2) uint16_t voltage5;
    alignas(2) uint16_t voltage6;
    alignas(2) uint16_t voltage7;
};
static_assert(sizeof(VOLTAGES_CB1_1_t) == 8, "struct size mismatch");

static inline const VOLTAGES_CB1_1_t *VOLTAGES_CB1_1__const_ptr_add(const VOLTAGES_CB1_1_t *p, size_t i) { return p + i; }
static inline VOLTAGES_CB1_1_t *VOLTAGES_CB1_1__ptr_add(VOLTAGES_CB1_1_t *p, size_t i) { return p + i; }
static inline VOLTAGES_CB1_1_struct_t VOLTAGES_CB1_1_vec_at(VOLTAGES_CB1_1_vec_t vec, size_t i)
__flatbuffers_struct_vec_at(vec, i)
static inline size_t VOLTAGES_CB1_1__size(void) { return 8; }
static inline size_t VOLTAGES_CB1_1_vec_len(VOLTAGES_CB1_1_vec_t vec)
__flatbuffers_vec_len(vec)
__flatbuffers_struct_as_root(VOLTAGES_CB1_1)

__flatbuffers_define_struct_scalar_field(VOLTAGES_CB1_1, voltage4, flatbuffers_uint16, uint16_t)
__flatbuffers_define_struct_scalar_field(VOLTAGES_CB1_1, voltage5, flatbuffers_uint16, uint16_t)
__flatbuffers_define_struct_scalar_field(VOLTAGES_CB1_1, voltage6, flatbuffers_uint16, uint16_t)
__flatbuffers_define_struct_scalar_field(VOLTAGES_CB1_1, voltage7, flatbuffers_uint16, uint16_t)

struct VOLTAGES_CB1_2 {
    alignas(2) uint16_t voltage8;
    alignas(2) uint16_t voltage9;
    alignas(2) uint16_t voltage10;
    alignas(2) uint16_t voltage11;
};
static_assert(sizeof(VOLTAGES_CB1_2_t) == 8, "struct size mismatch");

static inline const VOLTAGES_CB1_2_t *VOLTAGES_CB1_2__const_ptr_add(const VOLTAGES_CB1_2_t *p, size_t i) { return p + i; }
static inline VOLTAGES_CB1_2_t *VOLTAGES_CB1_2__ptr_add(VOLTAGES_CB1_2_t *p, size_t i) { return p + i; }
static inline VOLTAGES_CB1_2_struct_t VOLTAGES_CB1_2_vec_at(VOLTAGES_CB1_2_vec_t vec, size_t i)
__flatbuffers_struct_vec_at(vec, i)
static inline size_t VOLTAGES_CB1_2__size(void) { return 8; }
static inline size_t VOLTAGES_CB1_2_vec_len(VOLTAGES_CB1_2_vec_t vec)
__flatbuffers_vec_len(vec)
__flatbuffers_struct_as_root(VOLTAGES_CB1_2)

__flatbuffers_define_struct_scalar_field(VOLTAGES_CB1_2, voltage8, flatbuffers_uint16, uint16_t)
__flatbuffers_define_struct_scalar_field(VOLTAGES_CB1_2, voltage9, flatbuffers_uint16, uint16_t)
__flatbuffers_define_struct_scalar_field(VOLTAGES_CB1_2, voltage10, flatbuffers_uint16, uint16_t)
__flatbuffers_define_struct_scalar_field(VOLTAGES_CB1_2, voltage11, flatbuffers_uint16, uint16_t)

struct VOLTAGES_CB1_3 {
    alignas(2) uint16_t voltage12;
    alignas(2) uint16_t voltage13;
    alignas(2) uint16_t voltage14;
    alignas(2) uint16_t voltage15;
};
static_assert(sizeof(VOLTAGES_CB1_3_t) == 8, "struct size mismatch");

static inline const VOLTAGES_CB1_3_t *VOLTAGES_CB1_3__const_ptr_add(const VOLTAGES_CB1_3_t *p, size_t i) { return p + i; }
static inline VOLTAGES_CB1_3_t *VOLTAGES_CB1_3__ptr_add(VOLTAGES_CB1_3_t *p, size_t i) { return p + i; }
static inline VOLTAGES_CB1_3_struct_t VOLTAGES_CB1_3_vec_at(VOLTAGES_CB1_3_vec_t vec, size_t i)
__flatbuffers_struct_vec_at(vec, i)
static inline size_t VOLTAGES_CB1_3__size(void) { return 8; }
static inline size_t VOLTAGES_CB1_3_vec_len(VOLTAGES_CB1_3_vec_t vec)
__flatbuffers_vec_len(vec)
__flatbuffers_struct_as_root(VOLTAGES_CB1_3)

__flatbuffers_define_struct_scalar_field(VOLTAGES_CB1_3, voltage12, flatbuffers_uint16, uint16_t)
__flatbuffers_define_struct_scalar_field(VOLTAGES_CB1_3, voltage13, flatbuffers_uint16, uint16_t)
__flatbuffers_define_struct_scalar_field(VOLTAGES_CB1_3, voltage14, flatbuffers_uint16, uint16_t)
__flatbuffers_define_struct_scalar_field(VOLTAGES_CB1_3, voltage15, flatbuffers_uint16, uint16_t)

struct VOLTAGES_CB1_4 {
    alignas(2) uint16_t voltage16;
    alignas(2) uint16_t voltage17;
    alignas(2) uint16_t max_voltage;
    alignas(2) uint16_t min_voltage;
};
static_assert(sizeof(VOLTAGES_CB1_4_t) == 8, "struct size mismatch");

static inline const VOLTAGES_CB1_4_t *VOLTAGES_CB1_4__const_ptr_add(const VOLTAGES_CB1_4_t *p, size_t i) { return p + i; }
static inline VOLTAGES_CB1_4_t *VOLTAGES_CB1_4__ptr_add(VOLTAGES_CB1_4_t *p, size_t i) { return p + i; }
static inline VOLTAGES_CB1_4_struct_t VOLTAGES_CB1_4_vec_at(VOLTAGES_CB1_4_vec_t vec, size_t i)
__flatbuffers_struct_vec_at(vec, i)
static inline size_t VOLTAGES_CB1_4__size(void) { return 8; }
static inline size_t VOLTAGES_CB1_4_vec_len(VOLTAGES_CB1_4_vec_t vec)
__flatbuffers_vec_len(vec)
__flatbuffers_struct_as_root(VOLTAGES_CB1_4)

__flatbuffers_define_struct_scalar_field(VOLTAGES_CB1_4, voltage16, flatbuffers_uint16, uint16_t)
__flatbuffers_define_struct_scalar_field(VOLTAGES_CB1_4, voltage17, flatbuffers_uint16, uint16_t)
__flatbuffers_define_struct_scalar_field(VOLTAGES_CB1_4, max_voltage, flatbuffers_uint16, uint16_t)
__flatbuffers_define_struct_scalar_field(VOLTAGES_CB1_4, min_voltage, flatbuffers_uint16, uint16_t)

struct TEMPERATURES_CB1_0 {
    alignas(1) uint8_t temperature0;
    alignas(1) uint8_t temperature1;
    alignas(1) uint8_t temperature2;
    alignas(1) uint8_t temperature3;
    alignas(1) uint8_t temperature4;
    alignas(1) uint8_t temperature5;
    alignas(1) uint8_t temperature6;
    alignas(1) uint8_t temperature7;
};
static_assert(sizeof(TEMPERATURES_CB1_0_t) == 8, "struct size mismatch");

static inline const TEMPERATURES_CB1_0_t *TEMPERATURES_CB1_0__const_ptr_add(const TEMPERATURES_CB1_0_t *p, size_t i) { return p + i; }
static inline TEMPERATURES_CB1_0_t *TEMPERATURES_CB1_0__ptr_add(TEMPERATURES_CB1_0_t *p, size_t i) { return p + i; }
static inline TEMPERATURES_CB1_0_struct_t TEMPERATURES_CB1_0_vec_at(TEMPERATURES_CB1_0_vec_t vec, size_t i)
__flatbuffers_struct_vec_at(vec, i)
static inline size_t TEMPERATURES_CB1_0__size(void) { return 8; }
static inline size_t TEMPERATURES_CB1_0_vec_len(TEMPERATURES_CB1_0_vec_t vec)
__flatbuffers_vec_len(vec)
__flatbuffers_struct_as_root(TEMPERATURES_CB1_0)

__flatbuffers_define_struct_scalar_field(TEMPERATURES_CB1_0, temperature0, flatbuffers_uint8, uint8_t)
__flatbuffers_define_struct_scalar_field(TEMPERATURES_CB1_0, temperature1, flatbuffers_uint8, uint8_t)
__flatbuffers_define_struct_scalar_field(TEMPERATURES_CB1_0, temperature2, flatbuffers_uint8, uint8_t)
__flatbuffers_define_struct_scalar_field(TEMPERATURES_CB1_0, temperature3, flatbuffers_uint8, uint8_t)
__flatbuffers_define_struct_scalar_field(TEMPERATURES_CB1_0, temperature4, flatbuffers_uint8, uint8_t)
__flatbuffers_define_struct_scalar_field(TEMPERATURES_CB1_0, temperature5, flatbuffers_uint8, uint8_t)
__flatbuffers_define_struct_scalar_field(TEMPERATURES_CB1_0, temperature6, flatbuffers_uint8, uint8_t)
__flatbuffers_define_struct_scalar_field(TEMPERATURES_CB1_0, temperature7, flatbuffers_uint8, uint8_t)

struct TEMPERATURES_CB1_1 {
    alignas(1) uint8_t temperature8;
    alignas(1) uint8_t temperature9;
    alignas(1) uint8_t temperature10;
    alignas(1) uint8_t temperature11;
    alignas(1) uint8_t temperature12;
    alignas(1) uint8_t temperature13;
    alignas(1) uint8_t temperature14;
    alignas(1) uint8_t temperature15;
};
static_assert(sizeof(TEMPERATURES_CB1_1_t) == 8, "struct size mismatch");

static inline const TEMPERATURES_CB1_1_t *TEMPERATURES_CB1_1__const_ptr_add(const TEMPERATURES_CB1_1_t *p, size_t i) { return p + i; }
static inline TEMPERATURES_CB1_1_t *TEMPERATURES_CB1_1__ptr_add(TEMPERATURES_CB1_1_t *p, size_t i) { return p + i; }
static inline TEMPERATURES_CB1_1_struct_t TEMPERATURES_CB1_1_vec_at(TEMPERATURES_CB1_1_vec_t vec, size_t i)
__flatbuffers_struct_vec_at(vec, i)
static inline size_t TEMPERATURES_CB1_1__size(void) { return 8; }
static inline size_t TEMPERATURES_CB1_1_vec_len(TEMPERATURES_CB1_1_vec_t vec)
__flatbuffers_vec_len(vec)
__flatbuffers_struct_as_root(TEMPERATURES_CB1_1)

__flatbuffers_define_struct_scalar_field(TEMPERATURES_CB1_1, temperature8, flatbuffers_uint8, uint8_t)
__flatbuffers_define_struct_scalar_field(TEMPERATURES_CB1_1, temperature9, flatbuffers_uint8, uint8_t)
__flatbuffers_define_struct_scalar_field(TEMPERATURES_CB1_1, temperature10, flatbuffers_uint8, uint8_t)
__flatbuffers_define_struct_scalar_field(TEMPERATURES_CB1_1, temperature11, flatbuffers_uint8, uint8_t)
__flatbuffers_define_struct_scalar_field(TEMPERATURES_CB1_1, temperature12, flatbuffers_uint8, uint8_t)
__flatbuffers_define_struct_scalar_field(TEMPERATURES_CB1_1, temperature13, flatbuffers_uint8, uint8_t)
__flatbuffers_define_struct_scalar_field(TEMPERATURES_CB1_1, temperature14, flatbuffers_uint8, uint8_t)
__flatbuffers_define_struct_scalar_field(TEMPERATURES_CB1_1, temperature15, flatbuffers_uint8, uint8_t)

struct TEMPERATURES_CB1_2 {
    alignas(1) uint8_t temperature16;
    alignas(1) uint8_t temperature17;
    alignas(1) uint8_t max_temperature;
    alignas(1) uint8_t min_temperature;
};
static_assert(sizeof(TEMPERATURES_CB1_2_t) == 4, "struct size mismatch");

static inline const TEMPERATURES_CB1_2_t *TEMPERATURES_CB1_2__const_ptr_add(const TEMPERATURES_CB1_2_t *p, size_t i) { return p + i; }
static inline TEMPERATURES_CB1_2_t *TEMPERATURES_CB1_2__ptr_add(TEMPERATURES_CB1_2_t *p, size_t i) { return p + i; }
static inline TEMPERATURES_CB1_2_struct_t TEMPERATURES_CB1_2_vec_at(TEMPERATURES_CB1_2_vec_t vec, size_t i)
__flatbuffers_struct_vec_at(vec, i)
static inline size_t TEMPERATURES_CB1_2__size(void) { return 4; }
static inline size_t TEMPERATURES_CB1_2_vec_len(TEMPERATURES_CB1_2_vec_t vec)
__flatbuffers_vec_len(vec)
__flatbuffers_struct_as_root(TEMPERATURES_CB1_2)

__flatbuffers_define_struct_scalar_field(TEMPERATURES_CB1_2, temperature16, flatbuffers_uint8, uint8_t)
__flatbuffers_define_struct_scalar_field(TEMPERATURES_CB1_2, temperature17, flatbuffers_uint8, uint8_t)
__flatbuffers_define_struct_scalar_field(TEMPERATURES_CB1_2, max_temperature, flatbuffers_uint8, uint8_t)
__flatbuffers_define_struct_scalar_field(TEMPERATURES_CB1_2, min_temperature, flatbuffers_uint8, uint8_t)

struct VOLTAGES_CB2_0 {
    alignas(2) uint16_t voltage0;
    alignas(2) uint16_t voltage1;
    alignas(2) uint16_t voltage2;
    alignas(2) uint16_t voltage3;
};
static_assert(sizeof(VOLTAGES_CB2_0_t) == 8, "struct size mismatch");

static inline const VOLTAGES_CB2_0_t *VOLTAGES_CB2_0__const_ptr_add(const VOLTAGES_CB2_0_t *p, size_t i) { return p + i; }
static inline VOLTAGES_CB2_0_t *VOLTAGES_CB2_0__ptr_add(VOLTAGES_CB2_0_t *p, size_t i) { return p + i; }
static inline VOLTAGES_CB2_0_struct_t VOLTAGES_CB2_0_vec_at(VOLTAGES_CB2_0_vec_t vec, size_t i)
__flatbuffers_struct_vec_at(vec, i)
static inline size_t VOLTAGES_CB2_0__size(void) { return 8; }
static inline size_t VOLTAGES_CB2_0_vec_len(VOLTAGES_CB2_0_vec_t vec)
__flatbuffers_vec_len(vec)
__flatbuffers_struct_as_root(VOLTAGES_CB2_0)

__flatbuffers_define_struct_scalar_field(VOLTAGES_CB2_0, voltage0, flatbuffers_uint16, uint16_t)
__flatbuffers_define_struct_scalar_field(VOLTAGES_CB2_0, voltage1, flatbuffers_uint16, uint16_t)
__flatbuffers_define_struct_scalar_field(VOLTAGES_CB2_0, voltage2, flatbuffers_uint16, uint16_t)
__flatbuffers_define_struct_scalar_field(VOLTAGES_CB2_0, voltage3, flatbuffers_uint16, uint16_t)

struct VOLTAGES_CB2_1 {
    alignas(2) uint16_t voltage4;
    alignas(2) uint16_t voltage5;
    alignas(2) uint16_t voltage6;
    alignas(2) uint16_t voltage7;
};
static_assert(sizeof(VOLTAGES_CB2_1_t) == 8, "struct size mismatch");

static inline const VOLTAGES_CB2_1_t *VOLTAGES_CB2_1__const_ptr_add(const VOLTAGES_CB2_1_t *p, size_t i) { return p + i; }
static inline VOLTAGES_CB2_1_t *VOLTAGES_CB2_1__ptr_add(VOLTAGES_CB2_1_t *p, size_t i) { return p + i; }
static inline VOLTAGES_CB2_1_struct_t VOLTAGES_CB2_1_vec_at(VOLTAGES_CB2_1_vec_t vec, size_t i)
__flatbuffers_struct_vec_at(vec, i)
static inline size_t VOLTAGES_CB2_1__size(void) { return 8; }
static inline size_t VOLTAGES_CB2_1_vec_len(VOLTAGES_CB2_1_vec_t vec)
__flatbuffers_vec_len(vec)
__flatbuffers_struct_as_root(VOLTAGES_CB2_1)

__flatbuffers_define_struct_scalar_field(VOLTAGES_CB2_1, voltage4, flatbuffers_uint16, uint16_t)
__flatbuffers_define_struct_scalar_field(VOLTAGES_CB2_1, voltage5, flatbuffers_uint16, uint16_t)
__flatbuffers_define_struct_scalar_field(VOLTAGES_CB2_1, voltage6, flatbuffers_uint16, uint16_t)
__flatbuffers_define_struct_scalar_field(VOLTAGES_CB2_1, voltage7, flatbuffers_uint16, uint16_t)

struct VOLTAGES_CB2_2 {
    alignas(2) uint16_t voltage8;
    alignas(2) uint16_t voltage9;
    alignas(2) uint16_t voltage10;
    alignas(2) uint16_t voltage11;
};
static_assert(sizeof(VOLTAGES_CB2_2_t) == 8, "struct size mismatch");

static inline const VOLTAGES_CB2_2_t *VOLTAGES_CB2_2__const_ptr_add(const VOLTAGES_CB2_2_t *p, size_t i) { return p + i; }
static inline VOLTAGES_CB2_2_t *VOLTAGES_CB2_2__ptr_add(VOLTAGES_CB2_2_t *p, size_t i) { return p + i; }
static inline VOLTAGES_CB2_2_struct_t VOLTAGES_CB2_2_vec_at(VOLTAGES_CB2_2_vec_t vec, size_t i)
__flatbuffers_struct_vec_at(vec, i)
static inline size_t VOLTAGES_CB2_2__size(void) { return 8; }
static inline size_t VOLTAGES_CB2_2_vec_len(VOLTAGES_CB2_2_vec_t vec)
__flatbuffers_vec_len(vec)
__flatbuffers_struct_as_root(VOLTAGES_CB2_2)

__flatbuffers_define_struct_scalar_field(VOLTAGES_CB2_2, voltage8, flatbuffers_uint16, uint16_t)
__flatbuffers_define_struct_scalar_field(VOLTAGES_CB2_2, voltage9, flatbuffers_uint16, uint16_t)
__flatbuffers_define_struct_scalar_field(VOLTAGES_CB2_2, voltage10, flatbuffers_uint16, uint16_t)
__flatbuffers_define_struct_scalar_field(VOLTAGES_CB2_2, voltage11, flatbuffers_uint16, uint16_t)

struct VOLTAGES_CB2_3 {
    alignas(2) uint16_t voltage12;
    alignas(2) uint16_t voltage13;
    alignas(2) uint16_t voltage14;
    alignas(2) uint16_t voltage15;
};
static_assert(sizeof(VOLTAGES_CB2_3_t) == 8, "struct size mismatch");

static inline const VOLTAGES_CB2_3_t *VOLTAGES_CB2_3__const_ptr_add(const VOLTAGES_CB2_3_t *p, size_t i) { return p + i; }
static inline VOLTAGES_CB2_3_t *VOLTAGES_CB2_3__ptr_add(VOLTAGES_CB2_3_t *p, size_t i) { return p + i; }
static inline VOLTAGES_CB2_3_struct_t VOLTAGES_CB2_3_vec_at(VOLTAGES_CB2_3_vec_t vec, size_t i)
__flatbuffers_struct_vec_at(vec, i)
static inline size_t VOLTAGES_CB2_3__size(void) { return 8; }
static inline size_t VOLTAGES_CB2_3_vec_len(VOLTAGES_CB2_3_vec_t vec)
__flatbuffers_vec_len(vec)
__flatbuffers_struct_as_root(VOLTAGES_CB2_3)

__flatbuffers_define_struct_scalar_field(VOLTAGES_CB2_3, voltage12, flatbuffers_uint16, uint16_t)
__flatbuffers_define_struct_scalar_field(VOLTAGES_CB2_3, voltage13, flatbuffers_uint16, uint16_t)
__flatbuffers_define_struct_scalar_field(VOLTAGES_CB2_3, voltage14, flatbuffers_uint16, uint16_t)
__flatbuffers_define_struct_scalar_field(VOLTAGES_CB2_3, voltage15, flatbuffers_uint16, uint16_t)

struct VOLTAGES_CB2_4 {
    alignas(2) uint16_t voltage16;
    alignas(2) uint16_t voltage17;
    alignas(2) uint16_t max_voltage;
    alignas(2) uint16_t min_voltage;
};
static_assert(sizeof(VOLTAGES_CB2_4_t) == 8, "struct size mismatch");

static inline const VOLTAGES_CB2_4_t *VOLTAGES_CB2_4__const_ptr_add(const VOLTAGES_CB2_4_t *p, size_t i) { return p + i; }
static inline VOLTAGES_CB2_4_t *VOLTAGES_CB2_4__ptr_add(VOLTAGES_CB2_4_t *p, size_t i) { return p + i; }
static inline VOLTAGES_CB2_4_struct_t VOLTAGES_CB2_4_vec_at(VOLTAGES_CB2_4_vec_t vec, size_t i)
__flatbuffers_struct_vec_at(vec, i)
static inline size_t VOLTAGES_CB2_4__size(void) { return 8; }
static inline size_t VOLTAGES_CB2_4_vec_len(VOLTAGES_CB2_4_vec_t vec)
__flatbuffers_vec_len(vec)
__flatbuffers_struct_as_root(VOLTAGES_CB2_4)

__flatbuffers_define_struct_scalar_field(VOLTAGES_CB2_4, voltage16, flatbuffers_uint16, uint16_t)
__flatbuffers_define_struct_scalar_field(VOLTAGES_CB2_4, voltage17, flatbuffers_uint16, uint16_t)
__flatbuffers_define_struct_scalar_field(VOLTAGES_CB2_4, max_voltage, flatbuffers_uint16, uint16_t)
__flatbuffers_define_struct_scalar_field(VOLTAGES_CB2_4, min_voltage, flatbuffers_uint16, uint16_t)

struct TEMPERATURES_CB2_0 {
    alignas(1) uint8_t temperature0;
    alignas(1) uint8_t temperature1;
    alignas(1) uint8_t temperature2;
    alignas(1) uint8_t temperature3;
    alignas(1) uint8_t temperature4;
    alignas(1) uint8_t temperature5;
    alignas(1) uint8_t temperature6;
    alignas(1) uint8_t temperature7;
};
static_assert(sizeof(TEMPERATURES_CB2_0_t) == 8, "struct size mismatch");

static inline const TEMPERATURES_CB2_0_t *TEMPERATURES_CB2_0__const_ptr_add(const TEMPERATURES_CB2_0_t *p, size_t i) { return p + i; }
static inline TEMPERATURES_CB2_0_t *TEMPERATURES_CB2_0__ptr_add(TEMPERATURES_CB2_0_t *p, size_t i) { return p + i; }
static inline TEMPERATURES_CB2_0_struct_t TEMPERATURES_CB2_0_vec_at(TEMPERATURES_CB2_0_vec_t vec, size_t i)
__flatbuffers_struct_vec_at(vec, i)
static inline size_t TEMPERATURES_CB2_0__size(void) { return 8; }
static inline size_t TEMPERATURES_CB2_0_vec_len(TEMPERATURES_CB2_0_vec_t vec)
__flatbuffers_vec_len(vec)
__flatbuffers_struct_as_root(TEMPERATURES_CB2_0)

__flatbuffers_define_struct_scalar_field(TEMPERATURES_CB2_0, temperature0, flatbuffers_uint8, uint8_t)
__flatbuffers_define_struct_scalar_field(TEMPERATURES_CB2_0, temperature1, flatbuffers_uint8, uint8_t)
__flatbuffers_define_struct_scalar_field(TEMPERATURES_CB2_0, temperature2, flatbuffers_uint8, uint8_t)
__flatbuffers_define_struct_scalar_field(TEMPERATURES_CB2_0, temperature3, flatbuffers_uint8, uint8_t)
__flatbuffers_define_struct_scalar_field(TEMPERATURES_CB2_0, temperature4, flatbuffers_uint8, uint8_t)
__flatbuffers_define_struct_scalar_field(TEMPERATURES_CB2_0, temperature5, flatbuffers_uint8, uint8_t)
__flatbuffers_define_struct_scalar_field(TEMPERATURES_CB2_0, temperature6, flatbuffers_uint8, uint8_t)
__flatbuffers_define_struct_scalar_field(TEMPERATURES_CB2_0, temperature7, flatbuffers_uint8, uint8_t)

struct TEMPERATURES_CB2_1 {
    alignas(1) uint8_t temperature8;
    alignas(1) uint8_t temperature9;
    alignas(1) uint8_t temperature10;
    alignas(1) uint8_t temperature11;
    alignas(1) uint8_t temperature12;
    alignas(1) uint8_t temperature13;
    alignas(1) uint8_t temperature14;
    alignas(1) uint8_t temperature15;
};
static_assert(sizeof(TEMPERATURES_CB2_1_t) == 8, "struct size mismatch");

static inline const TEMPERATURES_CB2_1_t *TEMPERATURES_CB2_1__const_ptr_add(const TEMPERATURES_CB2_1_t *p, size_t i) { return p + i; }
static inline TEMPERATURES_CB2_1_t *TEMPERATURES_CB2_1__ptr_add(TEMPERATURES_CB2_1_t *p, size_t i) { return p + i; }
static inline TEMPERATURES_CB2_1_struct_t TEMPERATURES_CB2_1_vec_at(TEMPERATURES_CB2_1_vec_t vec, size_t i)
__flatbuffers_struct_vec_at(vec, i)
static inline size_t TEMPERATURES_CB2_1__size(void) { return 8; }
static inline size_t TEMPERATURES_CB2_1_vec_len(TEMPERATURES_CB2_1_vec_t vec)
__flatbuffers_vec_len(vec)
__flatbuffers_struct_as_root(TEMPERATURES_CB2_1)

__flatbuffers_define_struct_scalar_field(TEMPERATURES_CB2_1, temperature8, flatbuffers_uint8, uint8_t)
__flatbuffers_define_struct_scalar_field(TEMPERATURES_CB2_1, temperature9, flatbuffers_uint8, uint8_t)
__flatbuffers_define_struct_scalar_field(TEMPERATURES_CB2_1, temperature10, flatbuffers_uint8, uint8_t)
__flatbuffers_define_struct_scalar_field(TEMPERATURES_CB2_1, temperature11, flatbuffers_uint8, uint8_t)
__flatbuffers_define_struct_scalar_field(TEMPERATURES_CB2_1, temperature12, flatbuffers_uint8, uint8_t)
__flatbuffers_define_struct_scalar_field(TEMPERATURES_CB2_1, temperature13, flatbuffers_uint8, uint8_t)
__flatbuffers_define_struct_scalar_field(TEMPERATURES_CB2_1, temperature14, flatbuffers_uint8, uint8_t)
__flatbuffers_define_struct_scalar_field(TEMPERATURES_CB2_1, temperature15, flatbuffers_uint8, uint8_t)

struct TEMPERATURES_CB2_2 {
    alignas(1) uint8_t temperature16;
    alignas(1) uint8_t temperature17;
    alignas(1) uint8_t max_temperature;
    alignas(1) uint8_t min_temperature;
};
static_assert(sizeof(TEMPERATURES_CB2_2_t) == 4, "struct size mismatch");

static inline const TEMPERATURES_CB2_2_t *TEMPERATURES_CB2_2__const_ptr_add(const TEMPERATURES_CB2_2_t *p, size_t i) { return p + i; }
static inline TEMPERATURES_CB2_2_t *TEMPERATURES_CB2_2__ptr_add(TEMPERATURES_CB2_2_t *p, size_t i) { return p + i; }
static inline TEMPERATURES_CB2_2_struct_t TEMPERATURES_CB2_2_vec_at(TEMPERATURES_CB2_2_vec_t vec, size_t i)
__flatbuffers_struct_vec_at(vec, i)
static inline size_t TEMPERATURES_CB2_2__size(void) { return 4; }
static inline size_t TEMPERATURES_CB2_2_vec_len(TEMPERATURES_CB2_2_vec_t vec)
__flatbuffers_vec_len(vec)
__flatbuffers_struct_as_root(TEMPERATURES_CB2_2)

__flatbuffers_define_struct_scalar_field(TEMPERATURES_CB2_2, temperature16, flatbuffers_uint8, uint8_t)
__flatbuffers_define_struct_scalar_field(TEMPERATURES_CB2_2, temperature17, flatbuffers_uint8, uint8_t)
__flatbuffers_define_struct_scalar_field(TEMPERATURES_CB2_2, max_temperature, flatbuffers_uint8, uint8_t)
__flatbuffers_define_struct_scalar_field(TEMPERATURES_CB2_2, min_temperature, flatbuffers_uint8, uint8_t)

struct VOLTAGES_CB3_0 {
    alignas(2) uint16_t voltage0;
    alignas(2) uint16_t voltage1;
    alignas(2) uint16_t voltage2;
    alignas(2) uint16_t voltage3;
};
static_assert(sizeof(VOLTAGES_CB3_0_t) == 8, "struct size mismatch");

static inline const VOLTAGES_CB3_0_t *VOLTAGES_CB3_0__const_ptr_add(const VOLTAGES_CB3_0_t *p, size_t i) { return p + i; }
static inline VOLTAGES_CB3_0_t *VOLTAGES_CB3_0__ptr_add(VOLTAGES_CB3_0_t *p, size_t i) { return p + i; }
static inline VOLTAGES_CB3_0_struct_t VOLTAGES_CB3_0_vec_at(VOLTAGES_CB3_0_vec_t vec, size_t i)
__flatbuffers_struct_vec_at(vec, i)
static inline size_t VOLTAGES_CB3_0__size(void) { return 8; }
static inline size_t VOLTAGES_CB3_0_vec_len(VOLTAGES_CB3_0_vec_t vec)
__flatbuffers_vec_len(vec)
__flatbuffers_struct_as_root(VOLTAGES_CB3_0)

__flatbuffers_define_struct_scalar_field(VOLTAGES_CB3_0, voltage0, flatbuffers_uint16, uint16_t)
__flatbuffers_define_struct_scalar_field(VOLTAGES_CB3_0, voltage1, flatbuffers_uint16, uint16_t)
__flatbuffers_define_struct_scalar_field(VOLTAGES_CB3_0, voltage2, flatbuffers_uint16, uint16_t)
__flatbuffers_define_struct_scalar_field(VOLTAGES_CB3_0, voltage3, flatbuffers_uint16, uint16_t)

struct VOLTAGES_CB3_1 {
    alignas(2) uint16_t voltage4;
    alignas(2) uint16_t voltage5;
    alignas(2) uint16_t voltage6;
    alignas(2) uint16_t voltage7;
};
static_assert(sizeof(VOLTAGES_CB3_1_t) == 8, "struct size mismatch");

static inline const VOLTAGES_CB3_1_t *VOLTAGES_CB3_1__const_ptr_add(const VOLTAGES_CB3_1_t *p, size_t i) { return p + i; }
static inline VOLTAGES_CB3_1_t *VOLTAGES_CB3_1__ptr_add(VOLTAGES_CB3_1_t *p, size_t i) { return p + i; }
static inline VOLTAGES_CB3_1_struct_t VOLTAGES_CB3_1_vec_at(VOLTAGES_CB3_1_vec_t vec, size_t i)
__flatbuffers_struct_vec_at(vec, i)
static inline size_t VOLTAGES_CB3_1__size(void) { return 8; }
static inline size_t VOLTAGES_CB3_1_vec_len(VOLTAGES_CB3_1_vec_t vec)
__flatbuffers_vec_len(vec)
__flatbuffers_struct_as_root(VOLTAGES_CB3_1)

__flatbuffers_define_struct_scalar_field(VOLTAGES_CB3_1, voltage4, flatbuffers_uint16, uint16_t)
__flatbuffers_define_struct_scalar_field(VOLTAGES_CB3_1, voltage5, flatbuffers_uint16, uint16_t)
__flatbuffers_define_struct_scalar_field(VOLTAGES_CB3_1, voltage6, flatbuffers_uint16, uint16_t)
__flatbuffers_define_struct_scalar_field(VOLTAGES_CB3_1, voltage7, flatbuffers_uint16, uint16_t)

struct VOLTAGES_CB3_2 {
    alignas(2) uint16_t voltage8;
    alignas(2) uint16_t voltage9;
    alignas(2) uint16_t voltage10;
    alignas(2) uint16_t voltage11;
};
static_assert(sizeof(VOLTAGES_CB3_2_t) == 8, "struct size mismatch");

static inline const VOLTAGES_CB3_2_t *VOLTAGES_CB3_2__const_ptr_add(const VOLTAGES_CB3_2_t *p, size_t i) { return p + i; }
static inline VOLTAGES_CB3_2_t *VOLTAGES_CB3_2__ptr_add(VOLTAGES_CB3_2_t *p, size_t i) { return p + i; }
static inline VOLTAGES_CB3_2_struct_t VOLTAGES_CB3_2_vec_at(VOLTAGES_CB3_2_vec_t vec, size_t i)
__flatbuffers_struct_vec_at(vec, i)
static inline size_t VOLTAGES_CB3_2__size(void) { return 8; }
static inline size_t VOLTAGES_CB3_2_vec_len(VOLTAGES_CB3_2_vec_t vec)
__flatbuffers_vec_len(vec)
__flatbuffers_struct_as_root(VOLTAGES_CB3_2)

__flatbuffers_define_struct_scalar_field(VOLTAGES_CB3_2, voltage8, flatbuffers_uint16, uint16_t)
__flatbuffers_define_struct_scalar_field(VOLTAGES_CB3_2, voltage9, flatbuffers_uint16, uint16_t)
__flatbuffers_define_struct_scalar_field(VOLTAGES_CB3_2, voltage10, flatbuffers_uint16, uint16_t)
__flatbuffers_define_struct_scalar_field(VOLTAGES_CB3_2, voltage11, flatbuffers_uint16, uint16_t)

struct VOLTAGES_CB3_3 {
    alignas(2) uint16_t voltage12;
    alignas(2) uint16_t voltage13;
    alignas(2) uint16_t voltage14;
    alignas(2) uint16_t voltage15;
};
static_assert(sizeof(VOLTAGES_CB3_3_t) == 8, "struct size mismatch");

static inline const VOLTAGES_CB3_3_t *VOLTAGES_CB3_3__const_ptr_add(const VOLTAGES_CB3_3_t *p, size_t i) { return p + i; }
static inline VOLTAGES_CB3_3_t *VOLTAGES_CB3_3__ptr_add(VOLTAGES_CB3_3_t *p, size_t i) { return p + i; }
static inline VOLTAGES_CB3_3_struct_t VOLTAGES_CB3_3_vec_at(VOLTAGES_CB3_3_vec_t vec, size_t i)
__flatbuffers_struct_vec_at(vec, i)
static inline size_t VOLTAGES_CB3_3__size(void) { return 8; }
static inline size_t VOLTAGES_CB3_3_vec_len(VOLTAGES_CB3_3_vec_t vec)
__flatbuffers_vec_len(vec)
__flatbuffers_struct_as_root(VOLTAGES_CB3_3)

__flatbuffers_define_struct_scalar_field(VOLTAGES_CB3_3, voltage12, flatbuffers_uint16, uint16_t)
__flatbuffers_define_struct_scalar_field(VOLTAGES_CB3_3, voltage13, flatbuffers_uint16, uint16_t)
__flatbuffers_define_struct_scalar_field(VOLTAGES_CB3_3, voltage14, flatbuffers_uint16, uint16_t)
__flatbuffers_define_struct_scalar_field(VOLTAGES_CB3_3, voltage15, flatbuffers_uint16, uint16_t)

struct VOLTAGES_CB3_4 {
    alignas(2) uint16_t voltage16;
    alignas(2) uint16_t voltage17;
    alignas(2) uint16_t max_voltage;
    alignas(2) uint16_t min_voltage;
};
static_assert(sizeof(VOLTAGES_CB3_4_t) == 8, "struct size mismatch");

static inline const VOLTAGES_CB3_4_t *VOLTAGES_CB3_4__const_ptr_add(const VOLTAGES_CB3_4_t *p, size_t i) { return p + i; }
static inline VOLTAGES_CB3_4_t *VOLTAGES_CB3_4__ptr_add(VOLTAGES_CB3_4_t *p, size_t i) { return p + i; }
static inline VOLTAGES_CB3_4_struct_t VOLTAGES_CB3_4_vec_at(VOLTAGES_CB3_4_vec_t vec, size_t i)
__flatbuffers_struct_vec_at(vec, i)
static inline size_t VOLTAGES_CB3_4__size(void) { return 8; }
static inline size_t VOLTAGES_CB3_4_vec_len(VOLTAGES_CB3_4_vec_t vec)
__flatbuffers_vec_len(vec)
__flatbuffers_struct_as_root(VOLTAGES_CB3_4)

__flatbuffers_define_struct_scalar_field(VOLTAGES_CB3_4, voltage16, flatbuffers_uint16, uint16_t)
__flatbuffers_define_struct_scalar_field(VOLTAGES_CB3_4, voltage17, flatbuffers_uint16, uint16_t)
__flatbuffers_define_struct_scalar_field(VOLTAGES_CB3_4, max_voltage, flatbuffers_uint16, uint16_t)
__flatbuffers_define_struct_scalar_field(VOLTAGES_CB3_4, min_voltage, flatbuffers_uint16, uint16_t)

struct TEMPERATURES_CB3_0 {
    alignas(1) uint8_t temperature0;
    alignas(1) uint8_t temperature1;
    alignas(1) uint8_t temperature2;
    alignas(1) uint8_t temperature3;
    alignas(1) uint8_t temperature4;
    alignas(1) uint8_t temperature5;
    alignas(1) uint8_t temperature6;
    alignas(1) uint8_t temperature7;
};
static_assert(sizeof(TEMPERATURES_CB3_0_t) == 8, "struct size mismatch");

static inline const TEMPERATURES_CB3_0_t *TEMPERATURES_CB3_0__const_ptr_add(const TEMPERATURES_CB3_0_t *p, size_t i) { return p + i; }
static inline TEMPERATURES_CB3_0_t *TEMPERATURES_CB3_0__ptr_add(TEMPERATURES_CB3_0_t *p, size_t i) { return p + i; }
static inline TEMPERATURES_CB3_0_struct_t TEMPERATURES_CB3_0_vec_at(TEMPERATURES_CB3_0_vec_t vec, size_t i)
__flatbuffers_struct_vec_at(vec, i)
static inline size_t TEMPERATURES_CB3_0__size(void) { return 8; }
static inline size_t TEMPERATURES_CB3_0_vec_len(TEMPERATURES_CB3_0_vec_t vec)
__flatbuffers_vec_len(vec)
__flatbuffers_struct_as_root(TEMPERATURES_CB3_0)

__flatbuffers_define_struct_scalar_field(TEMPERATURES_CB3_0, temperature0, flatbuffers_uint8, uint8_t)
__flatbuffers_define_struct_scalar_field(TEMPERATURES_CB3_0, temperature1, flatbuffers_uint8, uint8_t)
__flatbuffers_define_struct_scalar_field(TEMPERATURES_CB3_0, temperature2, flatbuffers_uint8, uint8_t)
__flatbuffers_define_struct_scalar_field(TEMPERATURES_CB3_0, temperature3, flatbuffers_uint8, uint8_t)
__flatbuffers_define_struct_scalar_field(TEMPERATURES_CB3_0, temperature4, flatbuffers_uint8, uint8_t)
__flatbuffers_define_struct_scalar_field(TEMPERATURES_CB3_0, temperature5, flatbuffers_uint8, uint8_t)
__flatbuffers_define_struct_scalar_field(TEMPERATURES_CB3_0, temperature6, flatbuffers_uint8, uint8_t)
__flatbuffers_define_struct_scalar_field(TEMPERATURES_CB3_0, temperature7, flatbuffers_uint8, uint8_t)

struct TEMPERATURES_CB3_1 {
    alignas(1) uint8_t temperature8;
    alignas(1) uint8_t temperature9;
    alignas(1) uint8_t temperature10;
    alignas(1) uint8_t temperature11;
    alignas(1) uint8_t temperature12;
    alignas(1) uint8_t temperature13;
    alignas(1) uint8_t temperature14;
    alignas(1) uint8_t temperature15;
};
static_assert(sizeof(TEMPERATURES_CB3_1_t) == 8, "struct size mismatch");

static inline const TEMPERATURES_CB3_1_t *TEMPERATURES_CB3_1__const_ptr_add(const TEMPERATURES_CB3_1_t *p, size_t i) { return p + i; }
static inline TEMPERATURES_CB3_1_t *TEMPERATURES_CB3_1__ptr_add(TEMPERATURES_CB3_1_t *p, size_t i) { return p + i; }
static inline TEMPERATURES_CB3_1_struct_t TEMPERATURES_CB3_1_vec_at(TEMPERATURES_CB3_1_vec_t vec, size_t i)
__flatbuffers_struct_vec_at(vec, i)
static inline size_t TEMPERATURES_CB3_1__size(void) { return 8; }
static inline size_t TEMPERATURES_CB3_1_vec_len(TEMPERATURES_CB3_1_vec_t vec)
__flatbuffers_vec_len(vec)
__flatbuffers_struct_as_root(TEMPERATURES_CB3_1)

__flatbuffers_define_struct_scalar_field(TEMPERATURES_CB3_1, temperature8, flatbuffers_uint8, uint8_t)
__flatbuffers_define_struct_scalar_field(TEMPERATURES_CB3_1, temperature9, flatbuffers_uint8, uint8_t)
__flatbuffers_define_struct_scalar_field(TEMPERATURES_CB3_1, temperature10, flatbuffers_uint8, uint8_t)
__flatbuffers_define_struct_scalar_field(TEMPERATURES_CB3_1, temperature11, flatbuffers_uint8, uint8_t)
__flatbuffers_define_struct_scalar_field(TEMPERATURES_CB3_1, temperature12, flatbuffers_uint8, uint8_t)
__flatbuffers_define_struct_scalar_field(TEMPERATURES_CB3_1, temperature13, flatbuffers_uint8, uint8_t)
__flatbuffers_define_struct_scalar_field(TEMPERATURES_CB3_1, temperature14, flatbuffers_uint8, uint8_t)
__flatbuffers_define_struct_scalar_field(TEMPERATURES_CB3_1, temperature15, flatbuffers_uint8, uint8_t)

struct TEMPERATURES_CB3_2 {
    alignas(1) uint8_t temperature16;
    alignas(1) uint8_t temperature17;
    alignas(1) uint8_t max_temperature;
    alignas(1) uint8_t min_temperature;
};
static_assert(sizeof(TEMPERATURES_CB3_2_t) == 4, "struct size mismatch");

static inline const TEMPERATURES_CB3_2_t *TEMPERATURES_CB3_2__const_ptr_add(const TEMPERATURES_CB3_2_t *p, size_t i) { return p + i; }
static inline TEMPERATURES_CB3_2_t *TEMPERATURES_CB3_2__ptr_add(TEMPERATURES_CB3_2_t *p, size_t i) { return p + i; }
static inline TEMPERATURES_CB3_2_struct_t TEMPERATURES_CB3_2_vec_at(TEMPERATURES_CB3_2_vec_t vec, size_t i)
__flatbuffers_struct_vec_at(vec, i)
static inline size_t TEMPERATURES_CB3_2__size(void) { return 4; }
static inline size_t TEMPERATURES_CB3_2_vec_len(TEMPERATURES_CB3_2_vec_t vec)
__flatbuffers_vec_len(vec)
__flatbuffers_struct_as_root(TEMPERATURES_CB3_2)

__flatbuffers_define_struct_scalar_field(TEMPERATURES_CB3_2, temperature16, flatbuffers_uint8, uint8_t)
__flatbuffers_define_struct_scalar_field(TEMPERATURES_CB3_2, temperature17, flatbuffers_uint8, uint8_t)
__flatbuffers_define_struct_scalar_field(TEMPERATURES_CB3_2, max_temperature, flatbuffers_uint8, uint8_t)
__flatbuffers_define_struct_scalar_field(TEMPERATURES_CB3_2, min_temperature, flatbuffers_uint8, uint8_t)

struct VOLTAGES_CB4_0 {
    alignas(2) uint16_t voltage0;
    alignas(2) uint16_t voltage1;
    alignas(2) uint16_t voltage2;
    alignas(2) uint16_t voltage3;
};
static_assert(sizeof(VOLTAGES_CB4_0_t) == 8, "struct size mismatch");

static inline const VOLTAGES_CB4_0_t *VOLTAGES_CB4_0__const_ptr_add(const VOLTAGES_CB4_0_t *p, size_t i) { return p + i; }
static inline VOLTAGES_CB4_0_t *VOLTAGES_CB4_0__ptr_add(VOLTAGES_CB4_0_t *p, size_t i) { return p + i; }
static inline VOLTAGES_CB4_0_struct_t VOLTAGES_CB4_0_vec_at(VOLTAGES_CB4_0_vec_t vec, size_t i)
__flatbuffers_struct_vec_at(vec, i)
static inline size_t VOLTAGES_CB4_0__size(void) { return 8; }
static inline size_t VOLTAGES_CB4_0_vec_len(VOLTAGES_CB4_0_vec_t vec)
__flatbuffers_vec_len(vec)
__flatbuffers_struct_as_root(VOLTAGES_CB4_0)

__flatbuffers_define_struct_scalar_field(VOLTAGES_CB4_0, voltage0, flatbuffers_uint16, uint16_t)
__flatbuffers_define_struct_scalar_field(VOLTAGES_CB4_0, voltage1, flatbuffers_uint16, uint16_t)
__flatbuffers_define_struct_scalar_field(VOLTAGES_CB4_0, voltage2, flatbuffers_uint16, uint16_t)
__flatbuffers_define_struct_scalar_field(VOLTAGES_CB4_0, voltage3, flatbuffers_uint16, uint16_t)

struct VOLTAGES_CB4_1 {
    alignas(2) uint16_t voltage4;
    alignas(2) uint16_t voltage5;
    alignas(2) uint16_t voltage6;
    alignas(2) uint16_t voltage7;
};
static_assert(sizeof(VOLTAGES_CB4_1_t) == 8, "struct size mismatch");

static inline const VOLTAGES_CB4_1_t *VOLTAGES_CB4_1__const_ptr_add(const VOLTAGES_CB4_1_t *p, size_t i) { return p + i; }
static inline VOLTAGES_CB4_1_t *VOLTAGES_CB4_1__ptr_add(VOLTAGES_CB4_1_t *p, size_t i) { return p + i; }
static inline VOLTAGES_CB4_1_struct_t VOLTAGES_CB4_1_vec_at(VOLTAGES_CB4_1_vec_t vec, size_t i)
__flatbuffers_struct_vec_at(vec, i)
static inline size_t VOLTAGES_CB4_1__size(void) { return 8; }
static inline size_t VOLTAGES_CB4_1_vec_len(VOLTAGES_CB4_1_vec_t vec)
__flatbuffers_vec_len(vec)
__flatbuffers_struct_as_root(VOLTAGES_CB4_1)

__flatbuffers_define_struct_scalar_field(VOLTAGES_CB4_1, voltage4, flatbuffers_uint16, uint16_t)
__flatbuffers_define_struct_scalar_field(VOLTAGES_CB4_1, voltage5, flatbuffers_uint16, uint16_t)
__flatbuffers_define_struct_scalar_field(VOLTAGES_CB4_1, voltage6, flatbuffers_uint16, uint16_t)
__flatbuffers_define_struct_scalar_field(VOLTAGES_CB4_1, voltage7, flatbuffers_uint16, uint16_t)

struct VOLTAGES_CB4_2 {
    alignas(2) uint16_t voltage8;
    alignas(2) uint16_t voltage9;
    alignas(2) uint16_t voltage10;
    alignas(2) uint16_t voltage11;
};
static_assert(sizeof(VOLTAGES_CB4_2_t) == 8, "struct size mismatch");

static inline const VOLTAGES_CB4_2_t *VOLTAGES_CB4_2__const_ptr_add(const VOLTAGES_CB4_2_t *p, size_t i) { return p + i; }
static inline VOLTAGES_CB4_2_t *VOLTAGES_CB4_2__ptr_add(VOLTAGES_CB4_2_t *p, size_t i) { return p + i; }
static inline VOLTAGES_CB4_2_struct_t VOLTAGES_CB4_2_vec_at(VOLTAGES_CB4_2_vec_t vec, size_t i)
__flatbuffers_struct_vec_at(vec, i)
static inline size_t VOLTAGES_CB4_2__size(void) { return 8; }
static inline size_t VOLTAGES_CB4_2_vec_len(VOLTAGES_CB4_2_vec_t vec)
__flatbuffers_vec_len(vec)
__flatbuffers_struct_as_root(VOLTAGES_CB4_2)

__flatbuffers_define_struct_scalar_field(VOLTAGES_CB4_2, voltage8, flatbuffers_uint16, uint16_t)
__flatbuffers_define_struct_scalar_field(VOLTAGES_CB4_2, voltage9, flatbuffers_uint16, uint16_t)
__flatbuffers_define_struct_scalar_field(VOLTAGES_CB4_2, voltage10, flatbuffers_uint16, uint16_t)
__flatbuffers_define_struct_scalar_field(VOLTAGES_CB4_2, voltage11, flatbuffers_uint16, uint16_t)

struct VOLTAGES_CB4_3 {
    alignas(2) uint16_t voltage12;
    alignas(2) uint16_t voltage13;
    alignas(2) uint16_t voltage14;
    alignas(2) uint16_t voltage15;
};
static_assert(sizeof(VOLTAGES_CB4_3_t) == 8, "struct size mismatch");

static inline const VOLTAGES_CB4_3_t *VOLTAGES_CB4_3__const_ptr_add(const VOLTAGES_CB4_3_t *p, size_t i) { return p + i; }
static inline VOLTAGES_CB4_3_t *VOLTAGES_CB4_3__ptr_add(VOLTAGES_CB4_3_t *p, size_t i) { return p + i; }
static inline VOLTAGES_CB4_3_struct_t VOLTAGES_CB4_3_vec_at(VOLTAGES_CB4_3_vec_t vec, size_t i)
__flatbuffers_struct_vec_at(vec, i)
static inline size_t VOLTAGES_CB4_3__size(void) { return 8; }
static inline size_t VOLTAGES_CB4_3_vec_len(VOLTAGES_CB4_3_vec_t vec)
__flatbuffers_vec_len(vec)
__flatbuffers_struct_as_root(VOLTAGES_CB4_3)

__flatbuffers_define_struct_scalar_field(VOLTAGES_CB4_3, voltage12, flatbuffers_uint16, uint16_t)
__flatbuffers_define_struct_scalar_field(VOLTAGES_CB4_3, voltage13, flatbuffers_uint16, uint16_t)
__flatbuffers_define_struct_scalar_field(VOLTAGES_CB4_3, voltage14, flatbuffers_uint16, uint16_t)
__flatbuffers_define_struct_scalar_field(VOLTAGES_CB4_3, voltage15, flatbuffers_uint16, uint16_t)

struct VOLTAGES_CB4_4 {
    alignas(2) uint16_t voltage16;
    alignas(2) uint16_t voltage17;
    alignas(2) uint16_t max_voltage;
    alignas(2) uint16_t min_voltage;
};
static_assert(sizeof(VOLTAGES_CB4_4_t) == 8, "struct size mismatch");

static inline const VOLTAGES_CB4_4_t *VOLTAGES_CB4_4__const_ptr_add(const VOLTAGES_CB4_4_t *p, size_t i) { return p + i; }
static inline VOLTAGES_CB4_4_t *VOLTAGES_CB4_4__ptr_add(VOLTAGES_CB4_4_t *p, size_t i) { return p + i; }
static inline VOLTAGES_CB4_4_struct_t VOLTAGES_CB4_4_vec_at(VOLTAGES_CB4_4_vec_t vec, size_t i)
__flatbuffers_struct_vec_at(vec, i)
static inline size_t VOLTAGES_CB4_4__size(void) { return 8; }
static inline size_t VOLTAGES_CB4_4_vec_len(VOLTAGES_CB4_4_vec_t vec)
__flatbuffers_vec_len(vec)
__flatbuffers_struct_as_root(VOLTAGES_CB4_4)

__flatbuffers_define_struct_scalar_field(VOLTAGES_CB4_4, voltage16, flatbuffers_uint16, uint16_t)
__flatbuffers_define_struct_scalar_field(VOLTAGES_CB4_4, voltage17, flatbuffers_uint16, uint16_t)
__flatbuffers_define_struct_scalar_field(VOLTAGES_CB4_4, max_voltage, flatbuffers_uint16, uint16_t)
__flatbuffers_define_struct_scalar_field(VOLTAGES_CB4_4, min_voltage, flatbuffers_uint16, uint16_t)

struct TEMPERATURES_CB4_0 {
    alignas(1) uint8_t temperature0;
    alignas(1) uint8_t temperature1;
    alignas(1) uint8_t temperature2;
    alignas(1) uint8_t temperature3;
    alignas(1) uint8_t temperature4;
    alignas(1) uint8_t temperature5;
    alignas(1) uint8_t temperature6;
    alignas(1) uint8_t temperature7;
};
static_assert(sizeof(TEMPERATURES_CB4_0_t) == 8, "struct size mismatch");

static inline const TEMPERATURES_CB4_0_t *TEMPERATURES_CB4_0__const_ptr_add(const TEMPERATURES_CB4_0_t *p, size_t i) { return p + i; }
static inline TEMPERATURES_CB4_0_t *TEMPERATURES_CB4_0__ptr_add(TEMPERATURES_CB4_0_t *p, size_t i) { return p + i; }
static inline TEMPERATURES_CB4_0_struct_t TEMPERATURES_CB4_0_vec_at(TEMPERATURES_CB4_0_vec_t vec, size_t i)
__flatbuffers_struct_vec_at(vec, i)
static inline size_t TEMPERATURES_CB4_0__size(void) { return 8; }
static inline size_t TEMPERATURES_CB4_0_vec_len(TEMPERATURES_CB4_0_vec_t vec)
__flatbuffers_vec_len(vec)
__flatbuffers_struct_as_root(TEMPERATURES_CB4_0)

__flatbuffers_define_struct_scalar_field(TEMPERATURES_CB4_0, temperature0, flatbuffers_uint8, uint8_t)
__flatbuffers_define_struct_scalar_field(TEMPERATURES_CB4_0, temperature1, flatbuffers_uint8, uint8_t)
__flatbuffers_define_struct_scalar_field(TEMPERATURES_CB4_0, temperature2, flatbuffers_uint8, uint8_t)
__flatbuffers_define_struct_scalar_field(TEMPERATURES_CB4_0, temperature3, flatbuffers_uint8, uint8_t)
__flatbuffers_define_struct_scalar_field(TEMPERATURES_CB4_0, temperature4, flatbuffers_uint8, uint8_t)
__flatbuffers_define_struct_scalar_field(TEMPERATURES_CB4_0, temperature5, flatbuffers_uint8, uint8_t)
__flatbuffers_define_struct_scalar_field(TEMPERATURES_CB4_0, temperature6, flatbuffers_uint8, uint8_t)
__flatbuffers_define_struct_scalar_field(TEMPERATURES_CB4_0, temperature7, flatbuffers_uint8, uint8_t)

struct TEMPERATURES_CB4_1 {
    alignas(1) uint8_t temperature8;
    alignas(1) uint8_t temperature9;
    alignas(1) uint8_t temperature10;
    alignas(1) uint8_t temperature11;
    alignas(1) uint8_t temperature12;
    alignas(1) uint8_t temperature13;
    alignas(1) uint8_t temperature14;
    alignas(1) uint8_t temperature15;
};
static_assert(sizeof(TEMPERATURES_CB4_1_t) == 8, "struct size mismatch");

static inline const TEMPERATURES_CB4_1_t *TEMPERATURES_CB4_1__const_ptr_add(const TEMPERATURES_CB4_1_t *p, size_t i) { return p + i; }
static inline TEMPERATURES_CB4_1_t *TEMPERATURES_CB4_1__ptr_add(TEMPERATURES_CB4_1_t *p, size_t i) { return p + i; }
static inline TEMPERATURES_CB4_1_struct_t TEMPERATURES_CB4_1_vec_at(TEMPERATURES_CB4_1_vec_t vec, size_t i)
__flatbuffers_struct_vec_at(vec, i)
static inline size_t TEMPERATURES_CB4_1__size(void) { return 8; }
static inline size_t TEMPERATURES_CB4_1_vec_len(TEMPERATURES_CB4_1_vec_t vec)
__flatbuffers_vec_len(vec)
__flatbuffers_struct_as_root(TEMPERATURES_CB4_1)

__flatbuffers_define_struct_scalar_field(TEMPERATURES_CB4_1, temperature8, flatbuffers_uint8, uint8_t)
__flatbuffers_define_struct_scalar_field(TEMPERATURES_CB4_1, temperature9, flatbuffers_uint8, uint8_t)
__flatbuffers_define_struct_scalar_field(TEMPERATURES_CB4_1, temperature10, flatbuffers_uint8, uint8_t)
__flatbuffers_define_struct_scalar_field(TEMPERATURES_CB4_1, temperature11, flatbuffers_uint8, uint8_t)
__flatbuffers_define_struct_scalar_field(TEMPERATURES_CB4_1, temperature12, flatbuffers_uint8, uint8_t)
__flatbuffers_define_struct_scalar_field(TEMPERATURES_CB4_1, temperature13, flatbuffers_uint8, uint8_t)
__flatbuffers_define_struct_scalar_field(TEMPERATURES_CB4_1, temperature14, flatbuffers_uint8, uint8_t)
__flatbuffers_define_struct_scalar_field(TEMPERATURES_CB4_1, temperature15, flatbuffers_uint8, uint8_t)

struct TEMPERATURES_CB4_2 {
    alignas(1) uint8_t temperature16;
    alignas(1) uint8_t temperature17;
    alignas(1) uint8_t max_temperature;
    alignas(1) uint8_t min_temperature;
};
static_assert(sizeof(TEMPERATURES_CB4_2_t) == 4, "struct size mismatch");

static inline const TEMPERATURES_CB4_2_t *TEMPERATURES_CB4_2__const_ptr_add(const TEMPERATURES_CB4_2_t *p, size_t i) { return p + i; }
static inline TEMPERATURES_CB4_2_t *TEMPERATURES_CB4_2__ptr_add(TEMPERATURES_CB4_2_t *p, size_t i) { return p + i; }
static inline TEMPERATURES_CB4_2_struct_t TEMPERATURES_CB4_2_vec_at(TEMPERATURES_CB4_2_vec_t vec, size_t i)
__flatbuffers_struct_vec_at(vec, i)
static inline size_t TEMPERATURES_CB4_2__size(void) { return 4; }
static inline size_t TEMPERATURES_CB4_2_vec_len(TEMPERATURES_CB4_2_vec_t vec)
__flatbuffers_vec_len(vec)
__flatbuffers_struct_as_root(TEMPERATURES_CB4_2)

__flatbuffers_define_struct_scalar_field(TEMPERATURES_CB4_2, temperature16, flatbuffers_uint8, uint8_t)
__flatbuffers_define_struct_scalar_field(TEMPERATURES_CB4_2, temperature17, flatbuffers_uint8, uint8_t)
__flatbuffers_define_struct_scalar_field(TEMPERATURES_CB4_2, max_temperature, flatbuffers_uint8, uint8_t)
__flatbuffers_define_struct_scalar_field(TEMPERATURES_CB4_2, min_temperature, flatbuffers_uint8, uint8_t)

struct VOLTAGES_CB5_0 {
    alignas(2) uint16_t voltage0;
    alignas(2) uint16_t voltage1;
    alignas(2) uint16_t voltage2;
    alignas(2) uint16_t voltage3;
};
static_assert(sizeof(VOLTAGES_CB5_0_t) == 8, "struct size mismatch");

static inline const VOLTAGES_CB5_0_t *VOLTAGES_CB5_0__const_ptr_add(const VOLTAGES_CB5_0_t *p, size_t i) { return p + i; }
static inline VOLTAGES_CB5_0_t *VOLTAGES_CB5_0__ptr_add(VOLTAGES_CB5_0_t *p, size_t i) { return p + i; }
static inline VOLTAGES_CB5_0_struct_t VOLTAGES_CB5_0_vec_at(VOLTAGES_CB5_0_vec_t vec, size_t i)
__flatbuffers_struct_vec_at(vec, i)
static inline size_t VOLTAGES_CB5_0__size(void) { return 8; }
static inline size_t VOLTAGES_CB5_0_vec_len(VOLTAGES_CB5_0_vec_t vec)
__flatbuffers_vec_len(vec)
__flatbuffers_struct_as_root(VOLTAGES_CB5_0)

__flatbuffers_define_struct_scalar_field(VOLTAGES_CB5_0, voltage0, flatbuffers_uint16, uint16_t)
__flatbuffers_define_struct_scalar_field(VOLTAGES_CB5_0, voltage1, flatbuffers_uint16, uint16_t)
__flatbuffers_define_struct_scalar_field(VOLTAGES_CB5_0, voltage2, flatbuffers_uint16, uint16_t)
__flatbuffers_define_struct_scalar_field(VOLTAGES_CB5_0, voltage3, flatbuffers_uint16, uint16_t)

struct VOLTAGES_CB5_1 {
    alignas(2) uint16_t voltage4;
    alignas(2) uint16_t voltage5;
    alignas(2) uint16_t voltage6;
    alignas(2) uint16_t voltage7;
};
static_assert(sizeof(VOLTAGES_CB5_1_t) == 8, "struct size mismatch");

static inline const VOLTAGES_CB5_1_t *VOLTAGES_CB5_1__const_ptr_add(const VOLTAGES_CB5_1_t *p, size_t i) { return p + i; }
static inline VOLTAGES_CB5_1_t *VOLTAGES_CB5_1__ptr_add(VOLTAGES_CB5_1_t *p, size_t i) { return p + i; }
static inline VOLTAGES_CB5_1_struct_t VOLTAGES_CB5_1_vec_at(VOLTAGES_CB5_1_vec_t vec, size_t i)
__flatbuffers_struct_vec_at(vec, i)
static inline size_t VOLTAGES_CB5_1__size(void) { return 8; }
static inline size_t VOLTAGES_CB5_1_vec_len(VOLTAGES_CB5_1_vec_t vec)
__flatbuffers_vec_len(vec)
__flatbuffers_struct_as_root(VOLTAGES_CB5_1)

__flatbuffers_define_struct_scalar_field(VOLTAGES_CB5_1, voltage4, flatbuffers_uint16, uint16_t)
__flatbuffers_define_struct_scalar_field(VOLTAGES_CB5_1, voltage5, flatbuffers_uint16, uint16_t)
__flatbuffers_define_struct_scalar_field(VOLTAGES_CB5_1, voltage6, flatbuffers_uint16, uint16_t)
__flatbuffers_define_struct_scalar_field(VOLTAGES_CB5_1, voltage7, flatbuffers_uint16, uint16_t)

struct VOLTAGES_CB5_2 {
    alignas(2) uint16_t voltage8;
    alignas(2) uint16_t voltage9;
    alignas(2) uint16_t voltage10;
    alignas(2) uint16_t voltage11;
};
static_assert(sizeof(VOLTAGES_CB5_2_t) == 8, "struct size mismatch");

static inline const VOLTAGES_CB5_2_t *VOLTAGES_CB5_2__const_ptr_add(const VOLTAGES_CB5_2_t *p, size_t i) { return p + i; }
static inline VOLTAGES_CB5_2_t *VOLTAGES_CB5_2__ptr_add(VOLTAGES_CB5_2_t *p, size_t i) { return p + i; }
static inline VOLTAGES_CB5_2_struct_t VOLTAGES_CB5_2_vec_at(VOLTAGES_CB5_2_vec_t vec, size_t i)
__flatbuffers_struct_vec_at(vec, i)
static inline size_t VOLTAGES_CB5_2__size(void) { return 8; }
static inline size_t VOLTAGES_CB5_2_vec_len(VOLTAGES_CB5_2_vec_t vec)
__flatbuffers_vec_len(vec)
__flatbuffers_struct_as_root(VOLTAGES_CB5_2)

__flatbuffers_define_struct_scalar_field(VOLTAGES_CB5_2, voltage8, flatbuffers_uint16, uint16_t)
__flatbuffers_define_struct_scalar_field(VOLTAGES_CB5_2, voltage9, flatbuffers_uint16, uint16_t)
__flatbuffers_define_struct_scalar_field(VOLTAGES_CB5_2, voltage10, flatbuffers_uint16, uint16_t)
__flatbuffers_define_struct_scalar_field(VOLTAGES_CB5_2, voltage11, flatbuffers_uint16, uint16_t)

struct VOLTAGES_CB5_3 {
    alignas(2) uint16_t voltage12;
    alignas(2) uint16_t voltage13;
    alignas(2) uint16_t voltage14;
    alignas(2) uint16_t voltage15;
};
static_assert(sizeof(VOLTAGES_CB5_3_t) == 8, "struct size mismatch");

static inline const VOLTAGES_CB5_3_t *VOLTAGES_CB5_3__const_ptr_add(const VOLTAGES_CB5_3_t *p, size_t i) { return p + i; }
static inline VOLTAGES_CB5_3_t *VOLTAGES_CB5_3__ptr_add(VOLTAGES_CB5_3_t *p, size_t i) { return p + i; }
static inline VOLTAGES_CB5_3_struct_t VOLTAGES_CB5_3_vec_at(VOLTAGES_CB5_3_vec_t vec, size_t i)
__flatbuffers_struct_vec_at(vec, i)
static inline size_t VOLTAGES_CB5_3__size(void) { return 8; }
static inline size_t VOLTAGES_CB5_3_vec_len(VOLTAGES_CB5_3_vec_t vec)
__flatbuffers_vec_len(vec)
__flatbuffers_struct_as_root(VOLTAGES_CB5_3)

__flatbuffers_define_struct_scalar_field(VOLTAGES_CB5_3, voltage12, flatbuffers_uint16, uint16_t)
__flatbuffers_define_struct_scalar_field(VOLTAGES_CB5_3, voltage13, flatbuffers_uint16, uint16_t)
__flatbuffers_define_struct_scalar_field(VOLTAGES_CB5_3, voltage14, flatbuffers_uint16, uint16_t)
__flatbuffers_define_struct_scalar_field(VOLTAGES_CB5_3, voltage15, flatbuffers_uint16, uint16_t)

struct VOLTAGES_CB5_4 {
    alignas(2) uint16_t voltage16;
    alignas(2) uint16_t voltage17;
    alignas(2) uint16_t max_voltage;
    alignas(2) uint16_t min_voltage;
};
static_assert(sizeof(VOLTAGES_CB5_4_t) == 8, "struct size mismatch");

static inline const VOLTAGES_CB5_4_t *VOLTAGES_CB5_4__const_ptr_add(const VOLTAGES_CB5_4_t *p, size_t i) { return p + i; }
static inline VOLTAGES_CB5_4_t *VOLTAGES_CB5_4__ptr_add(VOLTAGES_CB5_4_t *p, size_t i) { return p + i; }
static inline VOLTAGES_CB5_4_struct_t VOLTAGES_CB5_4_vec_at(VOLTAGES_CB5_4_vec_t vec, size_t i)
__flatbuffers_struct_vec_at(vec, i)
static inline size_t VOLTAGES_CB5_4__size(void) { return 8; }
static inline size_t VOLTAGES_CB5_4_vec_len(VOLTAGES_CB5_4_vec_t vec)
__flatbuffers_vec_len(vec)
__flatbuffers_struct_as_root(VOLTAGES_CB5_4)

__flatbuffers_define_struct_scalar_field(VOLTAGES_CB5_4, voltage16, flatbuffers_uint16, uint16_t)
__flatbuffers_define_struct_scalar_field(VOLTAGES_CB5_4, voltage17, flatbuffers_uint16, uint16_t)
__flatbuffers_define_struct_scalar_field(VOLTAGES_CB5_4, max_voltage, flatbuffers_uint16, uint16_t)
__flatbuffers_define_struct_scalar_field(VOLTAGES_CB5_4, min_voltage, flatbuffers_uint16, uint16_t)

struct TEMPERATURES_CB5_0 {
    alignas(1) uint8_t temperature0;
    alignas(1) uint8_t temperature1;
    alignas(1) uint8_t temperature2;
    alignas(1) uint8_t temperature3;
    alignas(1) uint8_t temperature4;
    alignas(1) uint8_t temperature5;
    alignas(1) uint8_t temperature6;
    alignas(1) uint8_t temperature7;
};
static_assert(sizeof(TEMPERATURES_CB5_0_t) == 8, "struct size mismatch");

static inline const TEMPERATURES_CB5_0_t *TEMPERATURES_CB5_0__const_ptr_add(const TEMPERATURES_CB5_0_t *p, size_t i) { return p + i; }
static inline TEMPERATURES_CB5_0_t *TEMPERATURES_CB5_0__ptr_add(TEMPERATURES_CB5_0_t *p, size_t i) { return p + i; }
static inline TEMPERATURES_CB5_0_struct_t TEMPERATURES_CB5_0_vec_at(TEMPERATURES_CB5_0_vec_t vec, size_t i)
__flatbuffers_struct_vec_at(vec, i)
static inline size_t TEMPERATURES_CB5_0__size(void) { return 8; }
static inline size_t TEMPERATURES_CB5_0_vec_len(TEMPERATURES_CB5_0_vec_t vec)
__flatbuffers_vec_len(vec)
__flatbuffers_struct_as_root(TEMPERATURES_CB5_0)

__flatbuffers_define_struct_scalar_field(TEMPERATURES_CB5_0, temperature0, flatbuffers_uint8, uint8_t)
__flatbuffers_define_struct_scalar_field(TEMPERATURES_CB5_0, temperature1, flatbuffers_uint8, uint8_t)
__flatbuffers_define_struct_scalar_field(TEMPERATURES_CB5_0, temperature2, flatbuffers_uint8, uint8_t)
__flatbuffers_define_struct_scalar_field(TEMPERATURES_CB5_0, temperature3, flatbuffers_uint8, uint8_t)
__flatbuffers_define_struct_scalar_field(TEMPERATURES_CB5_0, temperature4, flatbuffers_uint8, uint8_t)
__flatbuffers_define_struct_scalar_field(TEMPERATURES_CB5_0, temperature5, flatbuffers_uint8, uint8_t)
__flatbuffers_define_struct_scalar_field(TEMPERATURES_CB5_0, temperature6, flatbuffers_uint8, uint8_t)
__flatbuffers_define_struct_scalar_field(TEMPERATURES_CB5_0, temperature7, flatbuffers_uint8, uint8_t)

struct TEMPERATURES_CB5_1 {
    alignas(1) uint8_t temperature8;
    alignas(1) uint8_t temperature9;
    alignas(1) uint8_t temperature10;
    alignas(1) uint8_t temperature11;
    alignas(1) uint8_t temperature12;
    alignas(1) uint8_t temperature13;
    alignas(1) uint8_t temperature14;
    alignas(1) uint8_t temperature15;
};
static_assert(sizeof(TEMPERATURES_CB5_1_t) == 8, "struct size mismatch");

static inline const TEMPERATURES_CB5_1_t *TEMPERATURES_CB5_1__const_ptr_add(const TEMPERATURES_CB5_1_t *p, size_t i) { return p + i; }
static inline TEMPERATURES_CB5_1_t *TEMPERATURES_CB5_1__ptr_add(TEMPERATURES_CB5_1_t *p, size_t i) { return p + i; }
static inline TEMPERATURES_CB5_1_struct_t TEMPERATURES_CB5_1_vec_at(TEMPERATURES_CB5_1_vec_t vec, size_t i)
__flatbuffers_struct_vec_at(vec, i)
static inline size_t TEMPERATURES_CB5_1__size(void) { return 8; }
static inline size_t TEMPERATURES_CB5_1_vec_len(TEMPERATURES_CB5_1_vec_t vec)
__flatbuffers_vec_len(vec)
__flatbuffers_struct_as_root(TEMPERATURES_CB5_1)

__flatbuffers_define_struct_scalar_field(TEMPERATURES_CB5_1, temperature8, flatbuffers_uint8, uint8_t)
__flatbuffers_define_struct_scalar_field(TEMPERATURES_CB5_1, temperature9, flatbuffers_uint8, uint8_t)
__flatbuffers_define_struct_scalar_field(TEMPERATURES_CB5_1, temperature10, flatbuffers_uint8, uint8_t)
__flatbuffers_define_struct_scalar_field(TEMPERATURES_CB5_1, temperature11, flatbuffers_uint8, uint8_t)
__flatbuffers_define_struct_scalar_field(TEMPERATURES_CB5_1, temperature12, flatbuffers_uint8, uint8_t)
__flatbuffers_define_struct_scalar_field(TEMPERATURES_CB5_1, temperature13, flatbuffers_uint8, uint8_t)
__flatbuffers_define_struct_scalar_field(TEMPERATURES_CB5_1, temperature14, flatbuffers_uint8, uint8_t)
__flatbuffers_define_struct_scalar_field(TEMPERATURES_CB5_1, temperature15, flatbuffers_uint8, uint8_t)

struct TEMPERATURES_CB5_2 {
    alignas(1) uint8_t temperature16;
    alignas(1) uint8_t temperature17;
    alignas(1) uint8_t max_temperature;
    alignas(1) uint8_t min_temperature;
};
static_assert(sizeof(TEMPERATURES_CB5_2_t) == 4, "struct size mismatch");

static inline const TEMPERATURES_CB5_2_t *TEMPERATURES_CB5_2__const_ptr_add(const TEMPERATURES_CB5_2_t *p, size_t i) { return p + i; }
static inline TEMPERATURES_CB5_2_t *TEMPERATURES_CB5_2__ptr_add(TEMPERATURES_CB5_2_t *p, size_t i) { return p + i; }
static inline TEMPERATURES_CB5_2_struct_t TEMPERATURES_CB5_2_vec_at(TEMPERATURES_CB5_2_vec_t vec, size_t i)
__flatbuffers_struct_vec_at(vec, i)
static inline size_t TEMPERATURES_CB5_2__size(void) { return 4; }
static inline size_t TEMPERATURES_CB5_2_vec_len(TEMPERATURES_CB5_2_vec_t vec)
__flatbuffers_vec_len(vec)
__flatbuffers_struct_as_root(TEMPERATURES_CB5_2)

__flatbuffers_define_struct_scalar_field(TEMPERATURES_CB5_2, temperature16, flatbuffers_uint8, uint8_t)
__flatbuffers_define_struct_scalar_field(TEMPERATURES_CB5_2, temperature17, flatbuffers_uint8, uint8_t)
__flatbuffers_define_struct_scalar_field(TEMPERATURES_CB5_2, max_temperature, flatbuffers_uint8, uint8_t)
__flatbuffers_define_struct_scalar_field(TEMPERATURES_CB5_2, min_temperature, flatbuffers_uint8, uint8_t)

struct MASTER_SYNC {
    alignas(4) uint32_t time;
};
static_assert(sizeof(MASTER_SYNC_t) == 4, "struct size mismatch");

static inline const MASTER_SYNC_t *MASTER_SYNC__const_ptr_add(const MASTER_SYNC_t *p, size_t i) { return p + i; }
static inline MASTER_SYNC_t *MASTER_SYNC__ptr_add(MASTER_SYNC_t *p, size_t i) { return p + i; }
static inline MASTER_SYNC_struct_t MASTER_SYNC_vec_at(MASTER_SYNC_vec_t vec, size_t i)
__flatbuffers_struct_vec_at(vec, i)
static inline size_t MASTER_SYNC__size(void) { return 4; }
static inline size_t MASTER_SYNC_vec_len(MASTER_SYNC_vec_t vec)
__flatbuffers_vec_len(vec)
__flatbuffers_struct_as_root(MASTER_SYNC)

__flatbuffers_define_struct_scalar_field(MASTER_SYNC, time, flatbuffers_uint32, uint32_t)

struct CELLBOARD_TOKEN {
    alignas(4) uint8_t sender_cellboard;
    alignas(4) uint32_t time;
};
static_assert(sizeof(CELLBOARD_TOKEN_t) == 8, "struct size mismatch");

static inline const CELLBOARD_TOKEN_t *CELLBOARD_TOKEN__const_ptr_add(const CELLBOARD_TOKEN_t *p, size_t i) { return p + i; }
static inline CELLBOARD_TOKEN_t *CELLBOARD_TOKEN__ptr_add(CELLBOARD_TOKEN_t *p, size_t i) { return p + i; }
static inline CELLBOARD_TOKEN_struct_t CELLBOARD_TOKEN_vec_at(CELLBOARD_TOKEN_vec_t vec, size_t i)
__flatbuffers_struct_vec_at(vec, i)
static inline size_t CELLBOARD_TOKEN__size(void) { return 8; }
static inline size_t CELLBOARD_TOKEN_vec_len(CELLBOARD_TOKEN_vec_t vec)
__flatbuffers_vec_len(vec)
__flatbuffers_struct_as_root(CELLBOARD_TOKEN)

__flatbuffers_define_struct_scalar_field(CELLBOARD_TOKEN, sender_cellboard, flatbuffers_uint8, uint8_t)
__flatbuffers_define_struct_scalar_field(CELLBOARD_TOKEN, time, flatbuffers_uint32, uint32_t)



#include "flatcc/flatcc_epilogue.h"
#endif /* SCHEMA_READER_H */
